# encoding: utf-8
# language: ru

Функционал: Проверка работы vanessa-behavior
	Как участник базового курса разработки по промышленным стандартам
	Хочу проверить работу инструмента vanessa behavior
	Чтобы использовать его в обучении и повседневной работе

Сценарий: Генерация epf
	Допустим у меня есть feature файл
	и у меня есть интсрумент vanessa-behavior
	Когда я в vanessa behavior запускаю генерацию внешней обработки
	Тогда рядом с feature файлом создается каталог а в нем внешняя обработка 1C
